---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralMaterialType
source: html/9dcf2408-cf65-b979-e1bb-4a5b60e9f23d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralMaterialType Property

"Structural Material Type"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralMaterialType { get; }
```